export const general = {
  _title: "TeamTune Report",
  noData: "محتوایی برای نمایش وجود ندارد",
  networkError: "ارتباط با سرور برقرار نشد. لطفا مجددا تلاش نمایید.",
  unknownError: "خطایی رخ داد. لطفا مجددا تلاش نمایید.",
  loading: "در حال دریافت اطلاعات",
  pageParamsError: "صفحه درخواستی به درستی بارگذاری نشده است.",
  itemNotFound: "آیتم یافت نشد.",
};

export const header = {
  title: "TeamTune Report",
};

export const sidebar = {
  dashboard: "داشبورد",
};

export const dashboardPage = {
  statistics: "آمارهای کلی",
  countAllUsers: "تعداد کاربران",
  userUnit: "نفر",
  austin: "وضعیت پیام‌ها در تیم شما | تحلیل بیانی و غیربیانی",
  austinHeader: "راهنمای نمودار:",
  austinText:
    "کلمات و جملات‌ علاوه بر دادن اطلاعات، بر انجام عملی مانند درخواست، نصيحت، پرسش، پيشگيری و ... دلالت دارند‌‌. در این بخش می‌توانید کارکردهای آشکار و پنهان در پیام‌های منتقل شده در تیم‌تان را مشاهده کنید.",
  illocutionary: "Illocutionary",
  illocutionaryHeader: "تحلیل غیر بیانی",
  illocutionaryText1: "راهنمای تحلیل غیر بیانی:",
  illocutionaryText2:
    "عملی که در قصد پیام همکار شما قابل کشف و تحلیل است در کنش غیر بیانی آمده است.",
  locutionary: "Locutionary",
  locutionaryHeader: "تحلیل بیانی",
  locutionaryText1: "راهنمای تحلیل بیانی:",
  locutionaryText2:
    "عملی که در ظاهر پیام همکار شما قابل رهگیری است در کنش بیانی آمده است.",
  searle: "وضعیت ارتباطی تیم شما | انواع کنش‌های گفتاری",
  searleChart: "Searle",
  searleHeader: "راهنمای نمودار:",
  searleText:
    "كنش اظهاری: ‌جمله‌هایی شامل اخبار، اظهارات، ادعاها، نتیجه‌گیری‌ها، بیانات و مانند آن، کنش اظهاری دارند.کنش ترغیبی: در پرسش‌ها و درخواست‌ها، امر و نهی‌ها و ... کنش ترغیبی دیده می‌شود.کنش تعهدی: همکار شما با توجه به جمله‌ای که بیان کرده ‌متعهد می‌شود در آینده کاری انجام دهد. مواردی مانند قول دادن، تعهد کردن و ... شامل کنش ‌تعهدی هستند.کنش عاطفی: همکار شما سعی دارد تا احساسات خود اعم از تاسف، خرسندی، ناامیدی و ... را به اشتراک بگذارد.کنش اعلامی: در کنش اعلامی همکار شما در پیام خود، سعی می‌کند شرایط تازه‌ای برای دیگران فراهم کند مانند اعلام کردن یا منصوب کردن.",
  expression: "وضعیت ارتباطی تیم شما | اکسپرشن یا پروجکشن",
  expressionHeader: "راهنمای نمودار:",
  expressionText:
    "در پیام‌های حاوی ‌پروجکشن فرد به شکل پنهانی و زیر پوستی ‌به دیگران احساس عدم کفایت می‌دهد، رقابت ایجاد می‌کند، کنایه می‌زند، ‌‌‌با ایجاد دوگانه‌ها به دنبال کنترل شرایط ‌است، جلوی ابراز نظر دیگران را می‌گیرد و ...در پیام‌های حاوی اکسپرشن فرد صادقانه و شفاف دغدغه‌ها و احساسات درونی خود را بیان می‌کند.",
  sentiment: "وضعیت ارتباطی تیم شما | تحلیل احساسات پیام‌ها",
  sentimentHeader: "راهنمای نمودار:",
  sentimentText:
    "منظور از احساسات مثبت مواردی مانند شادی، هیجان، خلاقیت و ... است  و منظور از احساسات منفی موارد ناخوشایند نظیر غم، خشم، دلخوری، اضطراب و ... است. توجه داشته باشید احساسات ارزش‌گذاری اخلاقی نمی‌شوند.",
  distribution: "وضعیت ارتباطی تیم شما | موضوعات کلیدی",
  distributionChart: "موضوعات کلیدی",
};
